In [38]:
import pandas as pd
import chart_studio.plotly as py

In [23]:
df_even_data= pd.read_csv("Modified_Event_Data_final.csv", dtype={"device_id":str})

In [24]:
df_even_data.groupby("newState").count()["device_id"]

newState
AndamanandNicobarIslands      1515
Andhra Pradesh                  47
AndhraPradesh               321263
ArunachalPradesh               608
Assam                        12021
Bihar                        35472
Chandigarh                     894
Chhattisgarh                  9754
Delhi                       751687
Goa                           3250
Gujarat                      42849
Haryana                      21053
HimachalPradesh               1409
JammuandKashmir               5385
Jharkhand                    18060
Karnataka                    99072
Kerala                       23148
Madhya Pradesh                  51
MadhyaPradesh               232639
Maharashtra                 677096
Manipur                        989
Meghalaya                     1515
Mizoram                       1613
Nagaland                      2298
Orissa                       15904
Pondicherry                   1741
Punjab                       26179
Rajasthan                   196329
Tamil Nadu                      47
TamilNadu                   436219
Telangana                    12784
Tripura                        892
Uttar Pradesh                   41
UttarPradesh                 94750
Uttaranchal                   7720
West Bengal                     42
WestBengal                  196161
Name: device_id, dtype: int64

In [25]:
df_even_data.head()

,Unnamed: 0,event_id,device_id,timestamp,longitude,latitude,city,state,newState,newCity
0,0,1.0,2.9182687948017176e+16,2016-05-01 00:55:25,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi
1,1,7104.0,2.9182687948017176e+16,2016-05-02 09:37:02,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi
2,2,29661.0,2.9182687948017176e+16,2016-05-04 00:56:04,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi
3,3,33133.0,2.9182687948017176e+16,2016-05-06 05:01:15,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi
4,4,38980.0,2.9182687948017176e+16,2016-05-06 09:55:04,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi

In [26]:
df_even_data.drop("Unnamed: 0",axis=1,inplace=True)

In [27]:
df_even_data.head()

,event_id,device_id,timestamp,longitude,latitude,city,state,newState,newCity
0,1.0,2.9182687948017176e+16,2016-05-01 00:55:25,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi
1,7104.0,2.9182687948017176e+16,2016-05-02 09:37:02,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi
2,29661.0,2.9182687948017176e+16,2016-05-04 00:56:04,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi
3,33133.0,2.9182687948017176e+16,2016-05-06 05:01:15,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi
4,38980.0,2.9182687948017176e+16,2016-05-06 09:55:04,77.266049,28.68161,Delhi,Delhi,Delhi,Delhi

In [28]:
df_even_data.drop_duplicates(subset=["device_id"],keep="first",inplace=True)

In [19]:
df_even_data[df_even_data.duplicated(subset="device_id")]

Empty DataFrame
Columns: [event_id, device_id, timestamp, longitude, latitude, city, state, newState, newCity]
Index: []

In [29]:
df_even_data.groupby("newState").count()["device_id"]

newState
AndamanandNicobarIslands      41
AndhraPradesh               4929
ArunachalPradesh              32
Assam                        483
Bihar                       1372
Chandigarh                    35
Chhattisgarh                 400
Delhi                       4909
Goa                           76
Gujarat                     1749
Haryana                      816
HimachalPradesh               31
JammuandKashmir              236
Jharkhand                    739
Karnataka                   6481
Kerala                       939
MadhyaPradesh               3220
Maharashtra                 9010
Manipur                       30
Meghalaya                     56
Mizoram                       70
Nagaland                     107
Orissa                       655
Pondicherry                   96
Punjab                      1055
Rajasthan                   3093
TamilNadu                   5770
Telangana                   3045
Tripura                       36
UttarPradesh                3660
Uttaranchal                  258
WestBengal                  7436
Name: device_id, dtype: int64